/*已有一个排好序（从大到小）的整数数组，例如
Int a[10]={ 100, 90, 80, 70, 60, 50 };
若继续输入一个整数，请按原先的从大到小顺序规律插入到合适位置。
完成操作后，请按序输出操作后的所有整数。
输入输出要求格式如下：
请输入要插入的整数：75
排序后：
100 90 80 75 70 60 50
*/
#include <stdio.h>
int main()
{
    int a[10]={ 100, 90, 80, 70, 60, 50 };
    int b,i,j;
    printf("请输入要插入的整数：");
    scanf("%d",&b);
    for(i=0;i<10;i++)
    {
        if(b>=a[i])
            break;
    }
    for(j=sizeof(a);j>sizeof(a)-i;j--)
    {
        a[j+1]=a[j];
    }
    a[i]=b;
    for(i=0;i<10;i++)
    {   
        if((a[i]!=0&&b!=0)||(b==0&&a[i-1]!=0))
        printf("%d ",a[i]);
    }
    return 0;
}